Revit 2024 API
ReferenceType Enumeration
Reference types of curve element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ReferenceType
Visual Basic
Public Enumeration ReferenceType
Visual C++
public enum class ReferenceType
Members
Member name | Description
None
WeakReference
StrongReference
See Also
Autodesk.Revit.DB Namespace